Repository: TedXpro/traveller_app
Catalog: lib/l10n/app_*.arb
Languages: am

source: Hawir
am: ሃዊር

source: Edit Profile
am: መገለጫ አርትዕ

source: Book a Trip
am: ጉዞ ይያዙ

source: Select Departure
am: መነሻ ይምረጡ

source: Select Destination
am: መድረሻ ይምረጡ

source: Departure
am: መነሻ

# returnDate
source: Destination
am: መድረሻ

source: Passengers
am: ተሳፋሪዎች

source: Search Travel
am: ጉዞ ይፈልጉ

source: Settings
am: ቅንብሮች

source: Log Out
am: ውጣ

source: Home
am: ቤት

source: Bookings
am: የተያዙ ቦታዎች

source: Check In
am: ቼክ ይግቡ

source: Profile
am: መገለጫ

source: Email
am: ኢሜይል

source: Password
am: የይለፍ ቃል

source: Forgot Password?
am: የይለፍ ቃል ረሱ?

source: Remember Me
am: አስታውሰኝ

source: Sign In
am: ይግቡ

source: Sign Up with Google
am: በGoogle ይመዝገቡ

source: Don't have an account?
am: መለያ የለዎትም?

source: Sign Up
am: ይመዝገቡ

# createAccount
source: Create an Account
am: መለያ ይፍጠሩ

source: First Name
am: የመጀመሪያ ስም

source: Last Name
am: የአባት ስም

source: Login Preference
am: የመግቢያ ምርጫ

source: Phone Number
am: ስልክ ቁጥር

source: Confirm Password
am: የይለፍ ቃል ያረጋግጡ

# thisFieldRequired
source: This field is required
am: ይህ መስክ ያስፈልጋል

# validEmail
source: Enter a valid email address
am: ልክ የሆነ የኢሜይል አድራሻ ያስገቡ

# validPhone
source: Enter a valid phone number
am: ልክ የሆነ የስልክ ቁጥር ያስገቡ

# validFirstName
source: First Name must contain only alphabets and be between 1 and 50 characters
am: የመጀመሪያ ስም ፊደላትን ብቻ መያዝ እና ከ1 እስከ 50 ቁምፊዎች መሆን አለበት

# validLastName
source: Last Name must contain only alphabets and be between 1 and 50 characters
am: የአባት ስም ፊደላትን ብቻ መያዝ እና ከ1 እስከ 50 ቁምፊዎች መሆን አለበት

# securePassword
source: Password must be at least 8 characters long, include uppercase, lowercase, number, and special character
am: የይለፍ ቃል ቢያንስ 8 ቁምፊ ርዝመት፣ ትልቅ ሆሄ፣ ትንሽ ሆሄ፣ ቁጥር እና ልዩ ቁምፊ መያዝ አለበት

# emailOption
source: Email
am: ኢሜይል

# phoneOption
source: Phone
am: ስልክ

# alreadyHaveAccount
source: Already have an account?
am: ቀድሞውኑ መለያ አለዎት?

source: Verification Email Sent
am: የማረጋገጫ ኢሜይል ተልኳል

# verificationEmailContent
source: A verification email has been sent to your account. Please check your inbox (and spam folder) to verify your email address.
am: የማረጋገጫ ኢሜይል ወደ መለያዎ ተልኳል። እባክዎ የኢሜይል አድራሻዎን ለማረጋገጥ ገቢ መልዕክት ሳጥንዎን (እና የአይፈለጌ መልዕክት አቃፊዎን) ያረጋግጡ።

source: OK
am: እሺ

source: Passwords do not match
am: የይለፍ ቃሎች አይዛመዱም

source: Sign up failed
am: ምዝገባ አልተሳካም

source: Incorrect email or password.
am: የተሳሳተ ኢሜይል ወይም የይለፍ ቃል

# unexpectedError
source: An unexpected error occurred.
am: ያልተጠበቀ ስህተት ተከስቷል

# networkError
source: Network error occurred.
am: የአውታረ መረብ ስህተት ተከስቷል

# pleaseEnterEmail
source: Please enter your email
am: እባክዎ ኢሜይልዎን ያስገቡ

# pleaseEnterPassword
source: Please enter your password
am: እባክዎ የይለፍ ቃልዎን ያስገቡ

# signUpError
source: Sign up error: {error}
am: የምዝገባ ስህተት: {error}

# welcome
source: Welcome {username}!
am: እንኳን ደህና መጡ {username}!

# pleaseSelectLocation
source: Please select a location.
am: እባክዎን ቦታ ይምረጡ።

# departureAfterReturn
source: Departure date cannot be after return date.
am: የመነሻ ቀን ከተመላሽ ቀን በኋላ መሆን አይችልም።

source: Available Trips
am: የሚገኙ ጉዞዎች

source: Filter Trips
am: ጉዞዎችን ያጣሩ

# priceRange
source: Price Range: {minprice} - {maxprice}
am: የዋጋ ክልል: $${minprice} - $${maxprice}

source: Apply
am: ተግብር

# agency
source: Agency: {agencyName}
am: ወኪል: {agencyName}

# price
source: Price: {price}
am: ዋጋ: {price}

source: Loading...
am: እየጫነ ነው...

source: Unknown Agency
am: ያልታወቀ ወኪል

source: Error Loading Agency
am: ወኪል በመጫን ላይ ስህተት

source: Travel Details
am: የጉዞ ዝርዝሮች

source: Start Location
am: የመነሻ ቦታ

source: Destination
am: መድረሻ

# priceDisplay
source: Price
am: ዋጋ

source: Arrival
am: ደረሰኝ

source: Driver
am: ሹፌር

source: Book Now
am: አሁን ይያዙ

source: Agency Not Found
am: ወኪል አልተገኘም

# failedToBookTravel
source: Failed to book travel: {error}
am: ጉዞ ለመያዝ አልተሳካም፡ {error}

source: Not Available
am: አይገኝም

source: Not Assigned
am: አልተመደበም

# seatChosen
source: Seat {seatNumber} chosen.
am: ወንበር {seatNumber} ተመርጧል።

source: Booking travel...
am: ጉዞ በመያዝ ላይ...

source: Change Password
am: የይለፍ ቃል ቀይር

source: Hide Password Change
am: የይለፍ ቃል ለውጥ ደብቅ

source: Old Password
am: የድሮ የይለፍ ቃል

source: New Password
am: አዲስ የይለፍ ቃል

source: Confirm New Password
am: አዲስ የይለፍ ቃል አረጋግጥ

source: Save Changes
am: ለውጦችን አስቀምጥ

# profileUpdatedSuccess
source: Profile updated successfully.
am: መገለጫ በተሳካ ሁኔታ ተዘምኗል።

# profileUpdatedRefetchFailed
source: Profile updated successfully, but failed to refetch data.
am: መገለጫ በተሳካ ሁኔታ ተዘምኗል፣ ነገር ግን ውሂብን እንደገና ለማግኘት አልተሳካም።

source: Theme
am: ገጽታ

source: Change app theme
am: የመተግበሪያ ገጽታ ቀይር

source: Language
am: ቋንቋ

# currentLanguage
source: Current Language: {languageName}
am: የአሁኑ ቋንቋ: {languageName}

source: English
am: እንግሊዝኛ

source: Amharic
am: አማርኛ

source: Notifications
am: ማስታወቂያዎች

source: Mark all as read
am: ሁሉንም እንደተነበበ ይምረጡ

source: No new notifications
am: አዲስ ማስታወቂያዎች የለም

# pleaseSelectSeat
source: Please select a seat.
am: እባክዎ ወንበር ይምረጡ።

# loginRequiredForBooking
source: Login is required for booking.
am: ለማስያዝ መግባት ያስፈልጋል።

source: Select your seat
am: ወንበርዎን ይምረጡ

source: Booking Details
am: የቦታ ማስያዝ ዝርዝሮች

source: Booking Summary
am: የቦታ ማስያዝ ማጠቃለያ

source: Travel ID
am: የጉዞ መለያ

source: Traveler ID
am: የተጓዥ መለያ

source: Seat No
am: የወንበር ቁጥር

source: Trip Type
am: የጉዞ አይነት

source: Payment Type
am: የክፍያ አይነት

source: Payment Ref
am: የክፍያ ማጣቀሻ

source: Book Time
am: የማስያዝ ሰዓት

source: Pay Time
am: የክፍያ ሰዓት

source: Not Paid Yet
am: እስካሁን አልተከፈለም

source: Book Time Limit
am: የማስያዝ የጊዜ ገደብ

source: Status
am: ሁኔታ

source: Proceed to Payment
am: ወደ ክፍያ ይቀጥሉ

source: Unknown Status
am: ያልታወቀ ሁኔታ

# bookingConfirmationTitle
source: Booking Confirmation
am: የቦታ ማስያዝ ማረጋገጫ

# bookingConfirmedMessage
source: Booking Confirmed!
am: የቦታ ማስያዝ ተረጋግጧል!

source: Payment Due
am: የክፍያ ጊዜ

source: Payment Amount
am: የክፍያ መጠን

# currencyETB
source: ETB
am: ብር

source: Initiating payment...
am: ክፍያ በመጀመር ላይ...

# paymentTitle
source: Trip Payment
am: የጉዞ ክፍያ

# paymentDescription
source: Payment for Travel ID: {travelId}
am: ለጉዞ መለያ: {travelId} ክፍያ

source: Payment successful!
am: ክፍያ በተሳካ ሁኔታ ተጠናቋል!

# paymentFailed
source: Payment failed: {message}
am: ክፍያ አልተሳካም: {message}

# paymentError
source: Payment error: {error}
am: የክፍያ ስህተት: {error}

# loginRequiredForPayment
source: Login is required for payment.
am: ለመክፈል መግባት ያስፈልጋል

# payButtonLabel
source: Pay Now
am: አሁን ይክፈሉ

source: Back to Bookings
am: ወደ ቦታ ማስያዝ ይመለሱ

# paymentSuccessTitle
source: Payment Successful
am: ክፍያ ስኬታማ

# paymentSuccessfulMessage
source: Your payment has been processed successfully!
am: ክፍያዎ በተሳካ ሁኔታ ተከናውኗል!

source: Go to Home
am: ወደ መነሻ ሂድ

# pleaseEnterPhoneNumber
source: Please enter your phone number.
am: እባክዎ ስልክ ቁጥርዎን ያስገቡ።

source: Saving changes...
am: ለውጦችን በማስቀመጥ ላይ...

# loginRequiredForSavingProfile
source: Login required to save profile changes.
am: የመገለጫ ለውጦችን ለማስቀመጥ መግባት ያስፈልጋል።

source: Profile updated successfully!
am: መገለጫ በተሳካ ሁኔታ ተዘምኗል!

# failedToUpdateProfile
source: Failed to update profile: {errorMessage}
am: መገለጫውን ማዘመን አልተሳካም: {errorMessage}

# pleaseFillAllPasswordFields
source: Please fill in all password fields.
am: እባክዎ ሁሉንም የይለፍ ቃል መስኮች ይሙሉ::

source: Changing password...
am: የይለፍ ቃል በመቀየር ላይ...

# loginRequiredForPasswordChange
source: Login required to change password.
am: የይለፍ ቃል ለመቀየር መግባት ያስፈልጋል።

source: Password changed successfully!
am: የይለፍ ቃል በተሳካ ሁኔታ ተቀይሯል!

# failedToChangePassword
source: Failed to change password: {errorMessage}
am: የይለፍ ቃል መቀየር አልተሳካም: {errorMessage}

source: Booking Reference
am: የቦታ ማስያዣ መለያ ቁጥር

# loginRequiredForBookingDetails
source: Login required to view booking details.
am: የቦታ ማስያዣ ዝርዝሮችን ለማየት መግባት ያስፈልጋል።

# paymentStatusTitle
source: Payment Status
am: የክፍያ ሁኔታ

source: Retry
am: እንደገና ይሞክሩ

source: Back to Home
am: ወደ መነሻ ገጽ ይመለሱ

# myBookingsTitle
source: My Bookings
am: የእኔ ቦታ ማስያዣዎች

source: No bookings found.
am: ምንም ቦታ ማስያዣ አልተገኘም

source: Booked on
am: የተያዘበት ቀን

source: From
am: ከ

source: Gallery
am: ጋለሪ

source: Camera
am: ካሜራ

# imageSelected
source: Image selected successfully.
am: ምስል በተሳካ ሁኔታ ተመርጧል።

# failedToPickImage
source: Failed to pick image: {errorMessage}
am: ምስል መምረጥ አልተቻለም: {errorMessage}

source: Failed to upload image.
am: ምስል መስቀል አልተቻለም።

# failedToUploadImageParam
source: Failed to upload image: {errorMessage}
am: ምስል መስቀል አልተቻለም: {errorMessage}

# destinationsTitle
source: Destinations
am: መዳረሻዎች

# failedToLoadDestinations
source: Failed to load destinations: {error}
am: መዳረሻዎችን መጫን አልተቻለም: {error}

source: No destinations found.
am: ምንም መዳረሻ አልተገኘም።

# failedToLoadDestinationDetails
source: Failed to load destination details: {error}
am: የመዳረሻ ዝርዝሮችን መጫን አልተቻለም: {error}

source: No description available.
am: መግለጫ የለም።

# cultureTitle
source: Culture
am: ባህል

# historyTitle
source: History
am: ታሪክ

# hotelsTitle
source: Hotels
am: ሆቴሎች

source: Unknown Hotel
am: ያልታወቀ ሆቴል

# attractionsTitle
source: Tourist Attractions
am: የቱሪስት መስህቦች

source: Unknown Attraction
am: ያልታወቀ መስህብ

source: Destination details not found.
am: የመዳረሻ ዝርዝሮች አልተገኙም።

# sendCodeButton
source: Send Code
am: ኮድ ላክ

# cancelButton
source: Cancel
am: ሰርዝ

# forgotPasswordEmailPrompt
source: Please enter your email address to receive a password reset code.
am: የይለፍ ቃል ዳግም ማስጀመሪያ ኮድ ለመቀበል ኢሜል አድራሻዎን ያስገቡ።

# forgotPasswordTitle
source: Forgot Password
am: የይለፍ ቃል ረሱ

source: Resetting password...
am: የይለፍ ቃል ዳግም እየተስተካከለ ነው...

# passwordResetSuccess
source: Password reset successfully. You can now sign in with your new password.
am: የይለፍ ቃል በተሳካ ሁኔታ ተስተካክሏል። አሁን በአዲሱ የይለፍ ቃልዎ መግባት ይችላሉ።

# passwordResetFailed
source: Password reset failed. Please check the code and try again.
am: የይለፍ ቃል ዳግም ማስተካከል አልተሳካም። እባክዎ ኮዱን ያረጋግጡ እና እንደገና ይሞክሩ።

# passwordResetError
source: Error resetting password: %s
am: የይለፍ ቃል ዳግም በሚስተካከልበት ጊዜ ስህተት ተፈጥሯል: {s}

# resetPasswordTitle
source: Reset Password
am: የይለፍ ቃል ዳግም አስጀምር

# resetPasswordPrompt
source: Enter the code sent to {email} and your new password.
am: ወደ {email} የተላከውን ኮድ እና አዲሱን የይለፍ ቃልዎን ያስገቡ።

# codeLabel
source: Code
am: ኮድ

# pleaseEnterCode
source: Please enter the code.
am: እባክዎ ኮዱን ያስገቡ።

# invalidCodeLength
source: Code must be 12 digits.
am: ኮድ 12 አሃዝ መሆን አለበት።

# newPasswordLabel
source: New Password
am: አዲስ የይለፍ ቃል

# pleaseEnterNewPassword
source: Please enter a new password.
am: እባክዎ አዲስ የይለፍ ቃል ያስገቡ።

# confirmPasswordLabel
source: Confirm New Password
am: አዲስ የይለፍ ቃል ያረጋግጡ

# pleaseConfirmPassword
source: Please confirm your new password.
am: እባክዎ አዲሱን የይለፍ ቃልዎን ያረጋግጡ።

# resetPasswordButton
source: Reset Password
am: የይለፍ ቃል ዳግም አስጀምር

source: Invalid password.
am: የተሳሳተ የይለፍ ቃል።

# forgotPasswordRequestError
source: Error requesting reset code: {error}
am: የዳግም ማስጀመሪያ ኮድ በሚጠየቅበት ጊዜ ስህተት ተፈጥሯል: {error}

# forgotPasswordRequestFailed
source: Failed to request reset code. Please check your email and try again.
am: የዳግም ማስጀመሪያ ኮድ ለመጠየቅ አልተሳካም። እባክዎ ኢሜልዎን ያረጋግጡ እና እንደገና ይሞክሩ።

# forgotPasswordEmailSent
source: A password reset code has been sent to {email}.
am: የይለፍ ቃል ዳግም ማስጀመሪያ ኮድ ወደ {email} ተልኳል።

source: Requesting reset code...
am: የዳግም ማስጀመሪያ ኮድ እየተጠየቀ ነው...

# noTravelsFound
source: No travels found matching your criteria.
am: መስፈርቶን የሚያሟላ ጉዞ አልተገኘም።

source: Departure: {time}
am: መነሻ ሰዓት: {time}

source: Filter by Agency
am: በኤጀንሲ አጣራ

source: All Agencies
am: ሁሉም ኤጀንሲዎች

source: Reset Filters
am: ማጣሪያዎችን ዳግም አስጀምር

source: Pickup Locations
am: የመውሰጃ ቦታዎች

source: Bus Reference
am: የአውቶቡስ ማጣቀሻ

# travelIdDisplay
source: Travel ID: {travelId}
am: የጉዞ መለያ: {travelId}

# loginRequiredForBookingsPage
source: Please log in to view your bookings.
am: ቦታ ማስያዣዎችዎን ለማየት እባክዎ ይግቡ።

# failedToLoadBookings
source: Failed to load bookings: {error}
am: ቦታ ማስያዣዎችን ለመጫን አልተሳካም: {error}

# startBookingMessage
source: It looks like you haven't booked any travels yet. Let's find your next adventure!
am: እስካሁን ምንም ጉዞ ያለመያዝ ይመስላል። ቀጣዩን ጀብዱዎን እንፈልግ!

source: Find New Travels
am: አዳዲስ ጉዞዎችን ፈልግ

# bookingStatusPending
source: Pending
am: በሂደት ላይ

# bookingStatusConfirmed
source: Confirmed
am: ተረጋግጧል

# bookingStatusCancelled
source: Cancelled
am: ተሰርዟል

# bookingStatusFailed
source: Failed
am: አልተሳካም

# sameLocationError
source: Departure and destination locations cannot be the same.
am: መነሻ እና መድረሻ ቦታዎች ተመሳሳይ ሊሆኑ አይችሉም።

# noTravelsFoundSearch
source: No travels found for your search.
am: ለፍለጋዎ ምንም ጉዞዎች አልተገኙም።

# adjustSearchCriteria
source: Try adjusting your locations or dates.
am: የመነሻ ቦታዎችን ወይም ቀናትን ለማስተካከል ይሞክሩ።

source: Clear Search
am: ፍለጋን አጽዳ

# searchError
source: Search failed: {errorMessage}
am: ፍለጋ አልተሳካም: {errorMessage}

source: Refresh Bookings
am: ቦታ ማስያዣዎችን አድስ

source: To
am: ወደ

# travelDetailsSection
source: Travel Details
am: የጉዞ ዝርዝሮች

source: Pay By
am: ይክፈሉ በ

source: Payment Details
am: የክፍያ ዝርዝሮች

# timeExpired
source: Expired
am: ጊዜው አልፏል

# timeRemainingDays
source: {days}d {hours}h {minutes}m {seconds}s
am: {days}ቀ {hours}ሰ {minutes}ደ {seconds}ሰ

# timeRemainingHours
source: {hours}h {minutes}m {seconds}s
am: {hours}ሰ {minutes}ደ {seconds}ሰ

# timeRemainingMinutes
source: {minutes}m {seconds}s
am: {minutes}ደ {seconds}ሰ

# timeRemainingSeconds
source: {seconds}s
am: {seconds}ሰ

# notificationsTitle
source: Notifications
am: ማሳወቂያዎች

# noTravellerIdError
source: Traveller ID not available. Please log in to view notifications.
am: የተጓዥ መለያ የለም። ማሳወቂያዎችን ለማየት እባክዎ ይግቡ።

# failedToLoadNotifications
source: Failed to load notifications: {errorMessage}. Please try again.
am: ማሳወቂያዎችን ለመጫን አልተሳካም: {errorMessage}። እባክዎ እንደገና ይሞክሩ።

source: No Notifications Yet!
am: እስካሁን ምንም ማሳወቂያ የለም!

# notificationEmptyMessage
source: When you have new updates or alerts, they'll appear here.
am: አዲስ ማሻሻያዎች ወይም ማስጠንቀቂያዎች ሲኖሩ፣ እዚህ ይታያሉ።

# markAsUnreadButton
source: Mark as Unread
am: እንደ ያልተነበበ ምልክት አድርግ

# closeButton
source: Close
am: ዝጋ

source: Posted On
am: የተለጠፈበት ቀን

# errorLoadingNotifications
source: Oops! Something went wrong.
am: ወይ ጉድ! የሆነ ስህተት ተፈጥሯል።

# tryAgainButton
source: Try Again
am: እንደገና ይሞክሩ

# markReadFailed
source: Failed to mark as read. Please try again.
am: እንደተነበበ ምልክት ማድረግ አልተሳካም። እባክዎ እንደገና ይሞክሩ።

# markReadSuccess
source: Notification marked as read.
am: ማሳወቂያ እንደተነበበ ምልክት ተደርጓል።

# markReadLoginRequired
source: Login required to mark notification as read.
am: ማሳወቂያ እንደተነበበ ምልክት ለማድረግ መግባት ያስፈልጋል።

# markReadError
source: Error marking as read: {errorMessage}
am: እንደተነበበ ምልክት ሲደረግ ስህተት: {errorMessage}

# markUnreadFailed
source: Failed to mark as unread. Please try again.
am: እንደ ያልተነበበ ምልክት ማድረግ አልተሳካም። እባክዎ እንደገና ይሞክሩ።

# markUnreadSuccess
source: Notification marked as unread.
am: ማሳወቂያ እንደ ያልተነበበ ምልክት ተደርጓል።

# markUnreadLoginRequired
source: Login required to mark notification as unread.
am: ማሳወቂያ እንደ ያልተነበበ ምልክት ለማድረግ መግባት ያስፈልጋል።

# markUnreadError
source: Error marking as unread: {errorMessage}
am: እንደ ያልተነበበ ምልክት ሲደረግ ስህተት: {errorMessage}

# markAsReadButton
source: Mark as Read
am: እንደተነበበ ምልክት አድርግ

# userAlreadyExists
source: A user with this email or phone number already exists.
am: በዚህ ኢሜል ወይም ስልክ ቁጥር ተጠቃሚ አለ።

# registrationPendingVerification
source: Your registration is awaiting email verification. Please check your inbox.
am: ምዝገባዎ የኢሜል ማረጋገጫ በመጠባበቅ ላይ ነው። እባክዎ ገቢ መልዕክት ሳጥንዎን ያረጋግጡ።

# signUpFailedGeneric
source: Sign up failed. Please try again or contact support.
am: ምዝገባ አልተሳካም። እባክዎ እንደገና ይሞክሩ ወይም ድጋፍ ሰጪን ያግኙ።

source: Traveler Details
am: የተጓዥ ዝርዝሮች

# pleaseFillAllFields
source: Please fill all required traveler details.
am: እባክዎ ሁሉንም አስፈላጊ የተጓዥ ዝርዝሮችን ይሙሉ።

source: Full Name
am: ሙሉ ስም

# userAlreadyExistsForTravel
source: Traveler details match an existing user. Please ensure the details are correct or sign in.
am: የተጓዥ ዝርዝሮች ካለ ተጠቃሚ ጋር ይመሳሰላሉ። እባክዎ ዝርዝሮቹ ትክክል መሆናቸውን ያረጋግጡ ወይም ይግቡ።

# validName
source: Please enter a valid name (letters, spaces, and hyphens only).
am: ትክክለኛ ስም ያስገቡ (ፊደሎች፣ ክፍተቶች እና ሰረዞች ብቻ)።
